const footerForInsert = `
<footer class="footer center active">
  <div class="footer_wrapper">
    <a class="footer_open"  on="tap:information.scrollTo()">Подробная информация</a>
  </div>
  <div class="footer-information open" id="information">
    <p class="footer_text">
    credits-house.by - это бесплатный информационный ресурс по подбору наилучшего варианта получения консультации по финансовым продуктам. Все размещенные материалы на сайте имеют информационный характер и охраняются законодательством об авторском праве.<br/>
      <br/>
      Владелец сайта ООО "Эй Би маркетинг", УНП 192770279, не оказывает услуг по оформлению и предоставлению населению микрозаймов, кредитов и других финансовых услуг, регулируемых Указом Президента №325 "О привлечении и предоставлении займов, деятельности микрофинансовых организаций", не является финансовой организацией.<br/>
      <br/>
      Действует в интересах Заказчика:<br/>
      <br/>
      ООО «Прокредит», УНП 192824533, Юр. адрес: РБ , 220069, г. Минск, пр-т Дзержинского, д.22, оф. 356<br/>
      <br/>
      Минимальная годовая ставка - 14,6%. Максимальная годовая ставка - 39,99%; Минимальный срок кредитования 61 день, максимальный срок кредитования - 84 месяца.<br/>
      При несвоевременной оплате процентов за пользование кредитом, насчитывается пеня в размере от 0,1% за каждый день просрочки. Конкретный процент прописан в договоре и зависит от выбранного банка. Комиссия брокера от 5% до 15% от суммы кредита.
    </p>
  
    <div class="footer_table">
      <p class="footer_table_title">Пример расчета кредита:</p>
      <div class="footer_table_wrapper">
  
        <div class="footer_table_row footer_table_row--title">
          <div class="footer_table_cell">Сумма</div>
          <div class="footer_table_cell">Срок кредита</div>
          <div class="footer_table_cell">Платежа в мес.</div>
          <div class="footer_table_cell">Итоговая сумма</div>
        </div>
  
        <div class="footer_table_row footer_table_row--odd">
          <div class="footer_table_cell">1 000 р.</div>
          <div class="footer_table_cell">6 мес.</div>
          <div class="footer_table_cell">190,00 р.</div>
          <div class="footer_table_cell">1 140 р.</div>
        </div>
  
        <div class="footer_table_row footer_table_row--even">
          <div class="footer_table_cell">5 000 р.</div>
          <div class="footer_table_cell">18 мес.</div>
          <div class="footer_table_cell">394,44 р.</div>
          <div class="footer_table_cell">7 100 р.</div>
        </div>
      </div>
    </div>

    <p class="footer_text">Для повышения удобства пользования веб-сайтом и персонализации сервисов на данном сайте используются файлы «Cookie». Файлы «cookie» содержат информацию о предыдущих посещениях веб-сайта. Если Вы не хотите использовать файлы «cookie», измените настройки Вашего браузера.</p>
  
    <p class="footer_text">
      В зависимости от территориальности и иных выбранных критериев, Вы, как потенциальный клиент одного из Заказчиков, даете согласие: <br />
      <a class="footer_link" href="/privacy.pdf" target="_blank">Форма согласия потенциальных клиентов на обработку персональных данных</a>
    </p>

    <a href="https://ablead.by/" class="footer_logo" target="_blank">
      Лидогенерация для банков –
      <svg xmlns="http://www.w3.org/2000/svg" width="80" height="22" fill="black">
        <path d="M80 3.995v11.167h-1V14c-.425.5-.85.766-1.38 1.023s-1.16.328-1.8.328a3.9 3.9 0 0 1-2.865-1.191 3.99 3.99 0 0 1-1.182-2.91 3.9 3.9 0 0 1 1.197-2.868A3.93 3.93 0 0 1 75.859 7.2c.648 0 1.238.086 1.76.357s.984.568 1.38 1.1V3.995h1zm-4.06 4.168c-.566 0-1.088.138-1.567.414a3.03 3.03 0 0 0-1.146 1.149 3.14 3.14 0 0 0-.42 1.57 3.12 3.12 0 0 0 .428 1.57 3.11 3.11 0 0 0 1.146 1.17 3.08 3.08 0 0 0 1.552.414c.556 0 1.083-.138 1.58-.414s.88-.65 1.146-1.12.406-1 .406-1.6c0-.9-.302-1.65-.907-2.254s-1.34-.906-2.22-.906zM70.42 7.4v7.762h-1V14c-.425.5-.85.766-1.38 1.023s-1.16.328-1.8.328a3.9 3.9 0 0 1-2.865-1.191 3.99 3.99 0 0 1-1.182-2.911A3.9 3.9 0 0 1 63.4 8.381 3.93 3.93 0 0 1 66.278 7.2c.648 0 1.238.086 1.76.357s.984.568 1.38 1.1V7.4h1zm-4.06.763c-.566 0-1.088.138-1.567.414s-.86.654-1.146 1.15a3.08 3.08 0 0 0-.42 1.57 3.12 3.12 0 0 0 .428 1.57 3.11 3.11 0 0 0 1.146 1.17 3.08 3.08 0 0 0 1.552.414c.556 0 1.083-.138 1.58-.414s.88-.65 1.146-1.12.406-1 .406-1.6c0-.9-.302-1.65-.907-2.254s-1.34-.906-2.22-.906zm-6.392 4.413l.85.444c-.28.544-.6.983-.966 1.317a3.89 3.89 0 0 1-1.233.766c-.457.172-.973.258-1.55.258-1.278 0-2.278-.415-3-1.246S53 12.338 53 11.287a4.15 4.15 0 0 1 .916-2.642c.774-.983 1.8-1.475 3.107-1.475 1.336 0 2.403.504 3.2 1.5.567.7.855 1.6.865 2.663h-7.05c.02.907.3 1.652.872 2.234a2.79 2.79 0 0 0 2.083.866c.4 0 .786-.07 1.16-.208s.702-.322.966-.55.55-.6.858-1.1zm0-2.098c-.135-.535-.332-.962-.6-1.282s-.593-.578-1.016-.773a3.14 3.14 0 0 0-1.334-.294 2.88 2.88 0 0 0-1.982.737c-.404.358-.7.895-.916 1.6h5.84zM49.446 3.9h-.998l-.002 9.054c.108 2.247 2.355 2.222 2.355 2.222h1.456V14.2H50.8c-1.4-.113-1.355-1.482-1.355-1.482V3.9z"/><path fill-rule="evenodd" d="M32.934 22c6.117 0 11.075-4.925 11.075-11S39.05 0 32.934 0 21.86 4.925 21.86 11s4.958 11 11.075 11zm.57-5.5l4.23-9.9-10.706 3.788 6.477 6.112z"/><path d="M9.58 3.995v11.167h1V14c.425.5.848.766 1.38 1.023s1.16.328 1.8.328a3.9 3.9 0 0 0 2.865-1.191 3.99 3.99 0 0 0 1.182-2.911A3.9 3.9 0 0 0 16.6 8.381 3.93 3.93 0 0 0 13.722 7.2c-.648 0-1.238.086-1.76.357s-.984.568-1.38 1.1V3.995h-1zm4.062 4.168c.566 0 1.088.138 1.566.414a3.03 3.03 0 0 1 1.146 1.149 3.14 3.14 0 0 1 .42 1.57 3.12 3.12 0 0 1-.428 1.57 3.11 3.11 0 0 1-1.146 1.17 3.08 3.08 0 0 1-1.552.414c-.556 0-1.083-.138-1.58-.414s-.88-.65-1.146-1.12-.406-1-.406-1.6c0-.9.302-1.65.907-2.254s1.34-.906 2.22-.906zM8.217 7.4v7.762h-1V14c-.425.5-.848.766-1.38 1.023s-1.16.328-1.8.328a3.9 3.9 0 0 1-2.865-1.191C.394 13.37 0 12.4 0 11.26a3.9 3.9 0 0 1 1.197-2.868A3.93 3.93 0 0 1 4.076 7.2c.648 0 1.238.086 1.76.357s.984.568 1.38 1.1V7.4h1zm-4.06.763c-.566 0-1.088.138-1.567.414a3.03 3.03 0 0 0-1.146 1.149 3.14 3.14 0 0 0-.42 1.57 3.12 3.12 0 0 0 .428 1.57 3.11 3.11 0 0 0 1.146 1.17 3.08 3.08 0 0 0 1.552.414c.556 0 1.083-.138 1.58-.414s.88-.65 1.146-1.12.406-1 .406-1.6c0-.9-.302-1.65-.907-2.254s-1.34-.906-2.22-.906z"/>
      </svg>
    </a>

  </div>
</footer>
`;

document.body.querySelector('.footerContainerToInsert').innerHTML = footerForInsert;

// const footer = document.body.querySelector('.footer');
// const footerOpen = footer.querySelector('.footer_open');
// const footerInformation = footer.querySelector('.footer-information');

// footerOpen.addEventListener('click', () => {
//   footerInformation.classList.toggle('open');
//   footerInformation.scrollIntoView({behavior: 'smooth'});
// })